package com.example.hamidreza.modeldata.Sample;

import com.example.hamidreza.modeldata.Model.DataItem;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;
import java.util.Map;

/**
 * Created by HAMIDREZA on 5/28/2017.
 */
public class SampleDataProvider {

    public static List<DataItem> dataItemList;
    public static Map<String, DataItem> dataItemMap;

    static {
        dataItemList = new ArrayList<>();
        dataItemMap = new HashMap<>();

        addItem(new DataItem(null, "خوراک ماهی قزل آلا ۵ ستاره", "Salads",
                "بتدا ماهی را فیله کرده ( بدون استخوان کرده ) و کله اش را" +
                        " می بریم وهر ماهی فیله شده را به چهار قسمت برش می دهیم، حتی می توانیم پوست ماهی فیله " +
                        "شده را هم بگیریم.در صورت نبود قزل آلا از نوع  دیگرماهی نیزمی توانید استفاده کنید.\n" +
                        "\n" +
                        "سیب زمینی را پوست گرفته و به ورقه های نازک برش می دهیم.\n" +
                        "\n" +
                        "کف قابلمه را قارچ خرد شده ریخته و بعد سیب زمینی ورقه شده را چیده و بعد ماهی را گذاریم." +
                        " سپس فلفل سبز به اندازه یک  بند انگشت خردشده" +
                        " را ریخته و دانه فلفل سیاه و برگ بو و لیمو ترش حلقه شده" +
                        " و بعد گوجه فرنگی خردشده را می ریزیم. روی مواد نمک می پاشیم." +
                        " روغن زیتون را ریخته وآب جوش را اضافه می کنیم. در ظرف را گذاشته" +
                        " و روی حرارت تند قرار می دهیم. بعد از جوشیدن حرارت را کم کرده." +
                        " حدود ۲۰ تا ۳۰ دقیقه طول می کشد  تا  سبب زمینی ها بپزد.",
                1, "ماهی قزل آلا  ۲عدد\n" +
                "قارچ  تکه شده ۱ کاسه متوسط حدود ۳۰۰ – ۲۰۰ گرم\n" +
                "گوجه ریز شده  ۳عدد\n" +
                "سیب زمینی متوسط  ۱عدد\n" +
                "فلفل سبز شیرین ۳عدد\n" +
                "لیمو ترش پوست گرفته بزرگ   ۱عدد\n" +
                "برگ بو  ۲ عدد\n" +
                "روغن زیتون  ۳ قاشق غذاخوری\n" +
                "فلفل سیاه ۴/۱ قاشق چایخوری\n" +
                "آب جوش  ۴/۱ فنجان\n" +
                "نمک  به میزان لازم\n" +
                "جعفری  یک دسته کوچک", "quinoa_salad.jpg"));

        addItem(new DataItem(null, "سالاد سر آشپز", "Salads",
                "1. در تابه\u200Cای حاوی روغن زیتون، نودل را تفت دهید سپس سینه مرغ و نان تست را به آن اضافه کرده، تفت دهید و از روی حرارت بردارید؛\n" +
                        "2. پس از سرد شدن، کاهوپیچ، ریحان، پیاز، فلفل دلمه\u200Cای، کاپریس، پنیر فتا و فلفل قرمز را در ظرف مورد نظر بریزید، مخلوط نودل را به آن افزوده و هم بزنید، سپس با سس آن را  سرو کنید.\n",
                2, "روغن زیتون 2 قاشق سوپ\u200Cخوری\n" +
                "نودل (نیم\u200Cپزشده) 200 گرم\n" +
                "سینه مرغ (گریل\u200Cشده) 1/2 عدد\n" +
                "نان تست (مکعبی خرد و تست\u200Cشده) 1/2 پیمانه\n" +
                "کاهوپیچ (رشته ای خردشده) 1 عدد\n" +
                "ریحان تازه (پاک و خردشده) 2 قاشق سوپ\u200Cخوری\n" +
                "پیاز کوچک (حلقه\u200Cای خردشده) 1 عدد\n" +
                "فلفل دلمه\u200Cای سبز (نگینی خردشده) 1/2 عدد\n" +
                "کاپریس 1 قاشق سوپ\u200Cخوری\n" +
                "پنیر فتا (مکعبی خردشده) 1/2 پیمانه\n" +
                "فلفل قرمز (پودرشده) 1 قاشق چای\u200Cخوری\n" +
                "سس به مقدار لازم", "chef_salad.jpg"));

        addItem(new DataItem(null, "سالاد خانگی", "Salads",
                "سبزیجات خرد شده را در ظرفی با هم مخلوط کنید. تن ماهی و زیتون ها را با نمک و فلفل طعم دار کنید. تخم مرغ ها را برش زده و با بقیه مواد مخلوط کرده و سرو کنید.",
                3, "کاهو 1 عدد\n" +
                "\n" +
                "گوجه فرنگی خرد شده  2 عدد متوسط\n" +
                "\n" +
                "خیار خرد شده 2 عدد\n" +
                "\n" +
                "زیتون سبز  1/2 پیمانه\n" +
                "\n" +
                "پیاز خلال شده   1عدد کوچک\n" +
                "\n" +
                "روغن زیتون  2 قاشق غذاخوری\n" +
                "\n" +
                "سرکه   2 قاشق غذا خوری\n" +
                "\n" +
                "تخم مرغ آب پز شده  3 عدد\n" +
                "\n" +
                "تن ماهی  400 گرم\n" +
                "\n" +
                "نمک و فلفل   به میزان لازم", "house_salad.jpg"));


        addItem(new DataItem(null, "چیز برگر", "Starters",
                "پنیر چدار و پنیر پیتزا را در یک کاسه کوچک مخلوط میکنیم.\n" +
                        " به آرامی گوشت، پاپریکا و فلفل و سس را در یک ظرف بزرگ مخلوط می کنیم ورز می دهیم، پودر سوخاری را به خوبی روی آن پخش می کنیم و دوباره ورز می دهیم، در صورتی احساس کردید هنوز گوشت شما آب دار است مقدار کمی دیگر به آن پودر سوخاری اضافه کنید و به مدت دو ساعت در یخچال بگذارید و بعد از آن آنها به شکل 8 تکه گرد نازک دربیاورید. دو قاشق برآمده از این مخلوط پنیر را در 4 تکه بریزید و از لبه ی آن به اندازه 1 سانتیمتر خالی بگذارید، هر کدام از تکه های باقی مانده را برای روی آن 4 تکه استفاده کنید و پنیر ها را بپوشانید. لبه های آنها را چین چین کنید و ببندید.\n" +
                        "ماهیتابه گریل را از قبل روی دمای متوسط به بالا گرم می کنیم، یا فر را گرم  میکنیم.\n" +
                        "برای گریل کردن، مقدار کمی روغن را به آرامی روی ظرف چدنی گریل (ماهیتابه گریل) بریزید، تکه گوشت های پرشده را با حرارت متوسط به بالا بپزید، حدود 5 دقیقه برای هر سمت به طور میانگین خوب می باشد، (مطمئن شوید که برگرها هنگام پختن فشرده نشوند و ترک آنها باز نشود و پنیر ها خارج شوند) در صورتی که از فر استفاده میکنید فر را از قبل گرم کنید و تابه  گریل را کمی روغن چرب نمایید، برای کباب کردن گوشت های تکه شده را در طبقه دوم با سوم فوقانی فر بگذارید، حدود 4 دقیقه برای هر سمت به طور میانگین خوب می باشد. می توانید بعد از چرخاندن گوشت ها دوباره از سس برای روی گوشت ها استفاده نمایید.\n" +
                        "نکته \n" +
                        "برای روغن ریختن رو ماهیتابه گریل:می توانید کاغذ پخت و پز را روغن بزنید، آن را روی ماهیتابه گریل بمالید.",
                1, " پنیر چدار خرد شده 1/4 پیمانه\n" +
                "پنیر پیتزا خرد شده 1/4 پیمانه\n" +
                " گوشت چرخ کرده 500 گرم\n" +
                " پودر سوخاری 2-3 قاشق غذا خوری\n" +
                "سس باربیکیو یا سس استیک2 قاشق غذا خوری\n" +
                "پاپریکا ( پودر فلفل دلمه ای قرمز خشک شده )1 و 1/2 قاشق چای خوری\n" +
                "فلفل سیاه1/4 قاشق چای خوری", "mini_cheeseburgers.jpg"));

        addItem(new DataItem(null, "قارچ شکم پر", "Starters",
                "روش پخت :\n" +
                        "پایه های قارچ ها را پس از جدا کردن به صورت نگینی خرد کنید\n" +
                        "سپس روغن زیتون را در تابه ای بریزید و روی شعله متوسط اجاق گاز داغ کنید.\n" +
                        "پس از آن، قارچ را همراه کرفس، هویج، کدو و پیازچه در روغن بریزید و به مدت 5 دقیقه این مخلوط را تفت دهید.\n" +
                        "مغز نان، ریحان خرد شده و رب گوجه فرنگی را همراه نمک و فلفل به مخلوط فوق اضافه کنید و یکی دو دقیقه تفت دهید.\n" +
                        "بعد از آن  قارچ ها را در ظرف گود مخصوص فر قرار دهید و داخل هر کدام را با مقداری از مخلوط سبزیجات پر کنید و در پایان سطح سبزیجات را با مقداری پنیر رنده شده بپوشانید.\n" +
                        "آب و قرص عصاره مرغ را با هم در ظرفی مخلوط کنید و روی قارچ ها بریزید.\n" +
                        "حالا ظرف را داخل فر که از یک ربع پیش روی 220 درجه سانتی گراد یا 425 درجه فارنهایت یا شماره 7 گرم کرده بودید، به مدت 20 دقیقه حرارت دهید تا قارچ ها پخته و پنیر روی آنها نیز آب شود.\n" +
                        " \n" +
                        "ارزش غذایی هر پرس\n" +
                        "انرژی : 273 کیلوکالریپروتئین : 13 گرم\n" +
                        "کربوهیدرات : 15 گرم \n" +
                        "قند : 5 گرم \n" +
                        "چربی : 18 گرم\n" +
                        "امیدواریم با تهیه این قارچ شکم پر خوشمزه، لذت کافی را برده و لحظات خوشی را در کنار خانواده سپری کنید.",
                2, "قارچ بزرگ : 8 عدد\n" +
                "کرفس : یک ساقه ( ریز خرد شود )\n" +
                "پیازچه : چند عدد ( ریز خرد شود )\n" +
                "کدوی سبز : تعدادی ( نگینی خرد شود )\n" +
                "هویج : تعدادی ( نگینی خرد شود )\n" +
                "مغز نان فانتزی : یک پیمانه\n" +
                "ریحان خرد شده : 2 قاشق سوپ خوری\n" +
                "رب گوجه فرنگی : یک قاشق سوپ خوری\n" +
                "پنیر چدار رنده شده : 75 گرم یا سه چهارم پیمانه\n" +
                "آب جوش : دو سوم پیمانه\n" +
                "قرص عصاره مرغ : نصف قرص\n" +
                "نمک و فلفل : به مقدار لازم", "stuffed_mushrooms.jpg"));

        addItem(new DataItem(null, "سوپ پیاز فرانسوی", "Starters",
                "کره را در قابلمه ای با آب کرده و پیازها را اضافه کنید. به مدت 25 دقیقه آنها را با حرارت ملایم تفت بدهید و هر از چند گاهی آنها را هم بزنید.\n" +
                        "پیاز باید رنگ طلایی متمایل به قهوه ای پیدا کند و کاراملی بشود (حالت چسبنده پیدا کند).\n" +
                        "در مرحله بعد آرد را بیافزایید و سپس آب و عصاره غلیظ مرغ را همراه با نمک و فلفل اضافه کنید.\n" +
                        "تکه های پنیر را نیز به این مواد افزوده و بگذارید سوپ جوش بیاید.\n" +
                        "پس از جوش آمدن حرارت آن را کم کنید تا آهسته به مدت 25 دقیقه با درب بسته بپزد. بعد از این مدت نمک و فلفل غذا را تنظیم کنید.\n" +
                        "نان باگت را برش زده و روی آنها پنیر رنده شده بریزید. آنها را زیر حرارت زیاد گریل فر، قرار دهید تا پنیر آب شود.\n" +
                        "سوپ را داخل کاسه بریزید و با برش های نان پنیری تزئین کنید.",
                3, "60 گرم کره\n" +
                "4 تا 5 عدد پیاز، باریک خلالی شده\n" +
                "50 گرم (⅓ فنجان) آرد ساده\n" +
                "2 لیتر آب\n" +
                "1 بسته عصاره مرغ\n" +
                "نمک و فلفل به مقدار لازم\n" +
                "100 گرم پنیر سوییسی مرغوب، نیمی رنده شده و نیمی نگینی خرد شده\n" +
                "یک عدد نان باگت", "french_onion_soup.jpg"));

        addItem(new DataItem(null, " کنگر فرنگی", "Starters",
                "گوشت گوسفند را درون یک کاسه بزرگ قرار دهید و روی آن نمک و فلفل ریخته و به مدت سی دقیقه در دمای اتاق قرار دهید. یک فنجان جعفری، سیر و پوست لیمو را درون یک کاسه با هم مخلوط کنید.\n" +
                        "روغن را درون یک قابلمه گرم کنید و گوشت را داخل روغن سرخ کنید به صورتی که هر دو تکه گوشت را به مدت هفت دقیقه سرخ کنید و سپس آنها را به یک کاسه متوسط انتقال دهید. تره فرنگی و پیاز را به آن افزوده و به مدت دو دقیقه سرخ کنید تا نرم شوند. سپس مخلوط جعفری و آویشن را به آن افزوده و 30 ثانیه آن ها را تفت دهید. سپس گوشت را دوباره به قابلمه برگردانید و آب مرغ را اضافه کنید و بگذارید به مدت یک ساعت و نیم آرام بجوشد تا گوشت نرم شود.(می توانید خورش را یک روز قبل از سرو هم آماده کنید و آن را داخل یخچال بدون سرپوش قرار دهید). یک کاسه متوسط را پر از آب کنید. آبلیمو را داخل کاسه بچکانید سپس لیمو را هم داخل آب بیندازید و کنگر های پاک شده را داخل آب و لیمو بریزید. سپس کنگر ها را آبکش کنید و به خوراک گوشت اضافه کرده، دوباره آن را به جوش آورید. بعد حرارت را کم کنید و درب قابلمه را بسته و آرام بجوشانید تا زمانی که کنگرها نرم تر شوند. می توانید در صورت تمایل آب مرغ بیشتری به خورش افزوده و به مدت بیست و پنج دقیقه آرام بجوشانید و روی آن مقداری نمک و فلفل ریخته سپس به کاسه انتقال دهید. روی خورش یک چهارم فنجان جعفری خرد شده را پخش کنید و در صورت تمایل با برنج سرو کنید.",
                4, "لفل سیاه: به مقدار مورد نیاز\n" +
                "نمک: به مقدار مورد نیاز\n" +
                "لیمو ترش:  نصف لیمو\n" +
                "کنگر فرنگی: هجده عدد\n" +
                "آب مرغ: یک و نیم فنجان – کم نمک\n" +
                "آویشن: سه چهارم قاشق چای خوری\n" +
                "پیاز: یک عدد – ورقه شده\n" +
                "تره فرنگی: دو عدد – خرد شده\n" +
                "روغن زیتون: سه قاشق غذاخوری\n" +
                "پوست لیمو: یک قاشق غذاخوری – رنده شده\n" +
                "جعفری: یک و یک چهارم فنجان – خرد شده\n" +
                "سیر: سه حبه  – خرد شده\n" +
                "گوشت گوسفند: یک کیلو پانصد گرم – گوشت سردست بدون استخوان و چربی – خرد شده", "artichokes.jpg"));

        addItem(new DataItem(null, "نان سیر با مغز مرغ و پارمسان", "Starters",
                "۱- سینه مرغ را به نوارهای باریک با ضخامت یک سانتی\u200Cمتری برش دهید.\n" +
                        "\n" +
                        "۲- آرد، تخم مرغ و خرده های نان ادویه دار را در سه کاسه جداگانه ریخته و کنار بگذارید.\n" +
                        "\n" +
                        "۳- نوارهای مرغ را به ترتیب درون آرد فرو کرده و آرد اضافه آن را بتکانید. سپس آن را درون تخم مرغ بغلتانید و در آخر درون خرده های نان غلتانده و کنار بگذارید.\n" +
                        "\n" +
                        "۴- این کار را تا اتمام تمامی مرغ ها ادامه دهید.\n" +
                        "\n" +
                        "۵- درون تابه روغن ریخته و بگذارید تا کاملا داغ شود. سپس فیله های مرغ را داخل آن انداخته و بگذارید با حرارت زیاد کاملا سرخ و طلایی شوند. در آخر هم مرغ های پخته شده را روی دستمال کاغذی حوله ای بگذارید تا روغن اضافی آنها گرفته شود.\n" +
                        "\n" +
                        "۶- در این مرحله باید به سراغ باگت رفته و آن را به سه یا ۴ قسمت مساوی تقسیم نمایید. لازم است اشاره کنیم که طول برش های نان باید به اندازه بلندی تکه های مرغ باشد.\n" +
                        "\n" +
                        "۷- با استفاده از چاقو یا دست، خمیر داخل نان های باگت را خالی کنید.\n" +
                        "\n" +
                        "۸- دو ورقه از پنیر موزارلا را روی هم گذاشته و یک عدد از مرغ های سوخاری را روی آنها قرار دهید. سپس پنیر را رول کرده و آن را درون نان باگت بگذارید.\n" +
                        "\n" +
                        "۹- در این مرحله، کف سینی فر یک لایه ورقه آلومینیومی گذاشته و روی آن را با کمی روغن چرب نمایید. سپس تکه های پر شده\u200Cی نان باگت را به اسلایس های باریک تر برش بزنید و در کنار هم درون سینی بچینید.\n" +
                        "\n" +
                        "۱۰- در یک کاسه کوچک، تمامی مواد ذکر شده برای کره سیر را با یکدیگر مخلوط نمایید. مخلوط به دست آمده را با قلم\u200Cمو روی برش های باگت بمالید تا تمامی سطح آنها را پوشش دهد.\n" +
                        "\n" +
                        "۱۱- فر را روشن کرده و بگذارید گرم شود.\n" +
                        "\n" +
                        "۱۲- ورقه آلومینیومی را روی نان برگردانده و آن را کاملا بپوشانید. سپس به مدت ۲۰ تا ۲۵ دقیقه درون فر قرار دهید تا سطح نان کاملا طلایی و برشته شود.\n" +
                        "\n" +
                        "۱۳- فویل را برداشته و این نان های بسیار لذیذ را به همراه سس گوجه فرنگی سرو نمایید.",
                5, "یک عدد سینه مرغ (بدون پوست و استخوان)\n" +
                "\n" +
                "۲ پیمانه آرد\n" +
                "\n" +
                "۴ عدد تخم مرغ همزده\n" +
                "\n" +
                "۲ پیمانه خرده های نان ادویه دار\n" +
                "\n" +
                "یک پیمانه روغن سرخ کردنی\n" +
                "\n" +
                "یک عدد نان باگت بزرگ\n" +
                "\n" +
                "۱۰ تا ۱۲ ورقه پنیر موزارلا\n" +
                "\n" +
                "سس گوجه فرنگی (با طعم سیر و فلفل)", "deviled_eggs.jpg"));


        addItem(new DataItem(null, " گوجه فرنگی های مینیاتوری", "Entrees",
                "\n" +
                        "1-      گوجه فرنگی های مینیاتوری را نصف کنید.\n" +
                        "2-      با یک چاقوی تیز، گوجه فرنگی های خشک را بصورت نواری ببرید.\n" +
                        "3-     گوجه فرنگی های مینیاتوری و گوجه فرنگی های خشک را در کاسه ای بریزید. روغن زیتون و  ریحان خرد شده را اضافه کرده و خوب با هم مخلوط کنید و سپس نمک و فلفل به آن بزنید.\n" +
                        "4-     نان های تست را کمی برشته کنید. سیرها را نصف کنید و روی هر دو طرف نان ها بمالید.\n" +
                        "5-     مخلوط آماده شده را روی نان ها بریزید و بلافاصله سرو کنید.\n" +
                        "نکته آشپزی:\n" +
                        "Ciabatta یک نوع نان روستایی ایتالیایی است که کمی سوراخ سوراخ و کاملاً ترد است. این نان، مناسب این غذاست چرا که سیر و روغن زیتون را کاملاً به خود جذب می کند.",
                1, "\n" +
                "300 گرم گوجه فرنگی مینیاتوری\n" +
                "4 عدد گوجه فرنگی خشک شده\n" +
                "4 قاشق غذاخوری روغن زیتون بکر\n" +
                "16 عدد برگ ریحان تازه، خرد شده\n" +
                "8 عدد نانCiabatta (نان تست آرد گندم)\n" +
                "2 حبه سیر\n" +
                "نمک و فلفل", "tortellini.jpg"));

        addItem(new DataItem(null, "پیتزا مرغ و قارچ", "Entrees",
                "قبل از اینکه شروع به پخت مواد پیتزا کنیم باید خمیرش رو طبق آموزش خمیر پیتزایی که اینجا قرار دادیم آماده کنیم تا در طول آماده کردن مواد، خمیرمون هم ور بیاد.\n" +
                        "\n" +
                        "مرغ رو به همراه پیاز و کمی زردچوبه، نمک، چوب دارچین و فلفل میگذاریم تا بپزه. بعد از اینکه پخت و کمی خنک شد، مرغها رو ریش ریش میکنیم. مقدار ریز شدن مرغها و ریش شدن اونها کاملا سلیقه ای هست و بستگی به ذائقه شما داره(من کمی درشت و با کارد خردش کردم که برش ها مشخص تر و زیبا تر باشه توی کار).یک پیاز متوسط رو نگینی خرد کردم و در مقداری روغن تفت دادم. فلفل دلمه های نگینی شده رو هم به پیاز در حال تفت خوردن اضافه کردم و حدود 5 دقیقه همه رو باهم سرخ کردم. البته خیلی مهمه که قبل از اضافه کردن فلفل دلمه ای ها، پیاز کمی تفت خورده و سبک شده باشه.\n" +
                        "\n" +
                        "بعد مرغ ریش شده رو به پیاز و فلفل اضافه کردم تا همراهشون تفت بخوره.مرغ روغن رو به خودش میکشه ولی دیگه لازم نیست که روغن اضافه کنیم.\n" +
                        "\n" +
                        "قارچ ها رو هم ورقه کردم و به جز یکی از قارچها که برای تزیین کنار گذاشتم، بقیه رو ریختم توی ماهیتابه تا کنار مرغ ها تفت بخوره یکم. بعد هم پودر کاری و آویشن رو اضافه کردم. بعد از حدود یکی دو دقیقه زیرش رو خاموش کردم. اگه قارچها خیلی نپخته بودن هم ایرادی نداره، همینکه کمی تفت بخوره کافیه.\n" +
                        "خمیر پیتزا رو به اندازه مناسب و طوری که قطرش بیشتر از نیم سانت نشه، پهن میکنیم. پنیر رو روی خمیر میریزیم(هرچی پنیر بیشتر باشه بهتر کش میاد)(اگه دوست داشتیم سس رو ابتدا روی خمیر میمالیم و بعد پنیر رو). بعد هم موادی که آماده کردیم، روی خمیر پهن میکنیم و پنیر پیتزا رو روش میریزیم باز." +
                        "برای تزیین میتونیم زاز قارچ ها و فلفل و حتی کمی سس استفاده کنیم. من قارچ ها رو روی پنیر ها چیدم و در آخر کمی آویشن خشک که با دست پودرش کردم روی پیتزا ریختم که باعث خوشگل تر شدنش شد." +
                        "در آخر هم در فر قرار بدین و در دمای 180-200 درجه سانتیگراد به مدت نیم ساعت بذارید تا بپزه. بعد از اینکه خمیر پخت کاملا و پنی ها طلایی شد پیتزای ما آماده اس."
                ,
                2, "مرغ نصف یک طرف سینه\n" +
                "قارچ 4-5 عدد\n" +
                "فلفل دلمه سبز و رنگی نگینی خرد شده نصف پیمانه\n" +
                "پیاز یک عدد متوسط\n" +
                "سس گوجه فرنگی (در صورت تمایل یک قاشق غذاخوری)\n" +
                "ادویه کاری یک قاشق مربا خوری\n" +
                "آویشن یک قاشق مربا خوری\n" +
                "نمک و فلفل\n" +
                "(این مقدار مواد حدودا برای یک پیتزای بزرگ هست )\n" +
                "پنیر پیتزا (موزارلا) 200 گرم (میتونه کمتر هم باشه)", "pizza.jpg"));

        addItem(new DataItem(null, "کباب توفو", "Entrees",
                "همه مواد را در مخلوط روغن کنجد، سویاسس، آبلیمو، سیر و فلفل حداقل نیم ساعت بخوابانید. سپس پنیر و سبزیجات را یکی در میان به سیخ کشیده و کباب کنید. \n" +
                        " \n" +
                        " \n" +
                        "نکات\n" +
                        " \n" +
                        "1. توفو نیازی به پخت زیاد ندارد، همین که روی آن برشته شد آماده خوردن است. \n" +
                        "2. مایه طعم دهنده کباب را به سلیقه خود عوض کنید. \n" +
                        "3. به جای توفو از هالومی یا پنیرکبابی که در بازار موجود است، می توان استفاده کرد. ",
                3, "وفو:400گرم، خرد شده\n" +
                " کدوی متوسط:2عدد، خرد شده\n" +
                " فلفل دلمه ای سبز:یک عدد، خرد شده\n" +
                " فلفل دلمه ای قرمز:یک عدد، خرد شده\n" +
                " فلفل دلمه ای زرد:یک عدد، خرد شده\n" +
                " روغن کنجد:یک چهارم پیمانه\n" +
                " سویاسس:4 قاشق غذاخوری\n" +
                " آبلیمو:4 قاشق غذاخوری\n" +
                " سیر:2حبه، ساطوری شده\n" +
                " فلفل قرمز:به میزان لازم", "tofu_skewers.jpg"));

//        addItem(new DataItem(null, "Fiesta Family Platter", "Entrees",
//                "This platter is perfect for sharing! Enjoy our spicy buffalo wings, traditional nachos, and cheese quesadillas served with freshly made guacamole dip.",
//                5, "hdjsh", "fiesta_platter.jpg"));

        addItem(new DataItem(null, "کرم بروله", "Desserts",
                "\n" +
                        "1. فر را بگذارید در دمای 325 درجه گرم شود. در ظرف فلزی شیرینی پزی سه و نیم فنجان آب داغ بریزید و در فر بگذارید.\n" +
                        "\n" +
                        "2. در مایکروفر خامه را به مدت 5 دقیقه با حرارت متوسط گرم کنید. بعد از مایکروفر درآورده و وانیل را به آن اضافه کنید.\n" +
                        "\n" +
                        "3. در این میان، زرده ها و شکر را در کاسه ای بزنید تا خوب مخلوط شوند. بعد به آرامی خامه گرم را به آن اضافه کنید. حالا با قاشق کف آن را بردارید.\n" +
                        "\n" +
                        "4. کرم بروله معمولاً در ظروف سفالی یا سرامیکی (رمکین) سرو می شود، زیرا این ظروف در برابر گرمای فر مقاومت بالایی دارند. مخلوط فوق را در رمکین ها بریزید و آنها را در ظرف آب جوش بگذارید. یادتان باشد که آب جوش باید تا نیمه ارتفاع رمکین ها باشد. کاستاردها را نیم ساعت بپزید. سپس رمکین ها را از داخل آب دربیاورید و بگذارید نیم ساعت سرد شوند. روی آنها را با سلفون بکشید و در یخچال بگذارید تا 4 ساعت بمانند." +
                        "\n" +
                        "5. یکی دو ساعت قبل از سرو کردن، شعله بالایی فر را روشن کنید. شکر قهوه ای را روی کاستاردها بپاشید. سعی کنید لایه ای یکنواخت و غیرضخیم از شکر روی آنها بپاشید که وقتی سفت می شوند خوردن آنها به دندانتان آسیب نزند. حالا رمکین ها را داخل فر و در طبقه فوقانی آن بگذارید تا 2 تا 3 دقیقه شعله بالایی شکر قهوه ای آنها را آب کند و قهوه ای شود. بعد آنها را دربیاورید و فوراً در فریزر بگذارید تا 1 ساعت سفت شود و شکر قهوه ای روی آنها تبدیل به قشر محکمی شود. البته در روش سنتی، باید از فندک یا بلو تورچ برای سوزاندن شکر روی کاستارد استفاده کرد.",
                1, "1 فنجان خامه سبک و کم چرب\n" +
                "•    1 فنجان خامه سنگین یا پرچرب\n" +
                "•    یک و نیم قاشق چایخوری عصاره وانیل\n" +
                "•    5 زرده تخم مرغ\n" +
                "•    یک سوم فنجان شکر ریزدانه\n" +
                "•    2 قاشق غذاخوری شکر قهوه ای", "creme_brulee.jpg"));

        addItem(new DataItem(null, "کیک پنیری", "Desserts",
                " \n" +
                        "۱- با استفاده از یک مخلوط کن، شکر و بیسکویت را با هم مخلوط کنید، سپس کره آب شده را به مخلوط اضافه کنید و خوب هم زنید.\n" +
                        " \n" +
                        "۲- کاغذهای مخصوص کیک را درون قالب های خود قرار داده و با قاشق مخلوط بیسکویت را درون آن ها بریزید و سر آن ها را با یک قاشق فلزی صاف و مرتب کنید. سپس آن ها را در یخچال قرار دهید تا سرد شوند.\n" +
                        " \n" +
                        "۳- در یک کاسه بزرگ با استفاده از یک همزن یا یک قاشق چوبی، پنیر خامه ای خاکه قند و وانیل را خوب مخلوط کنید.\n" +
                        " \n" +
                        "۴- خامه را به آرامی به مخلوط اضافه کنید و خوب هم زنید. مطمئن شوید هیچ حبابی در آن باقی نماند.\n" +
                        " \n" +
                        "۵- مخلوط خامه را روی بیسکویت سرد شده قرار دهید و سر آن را با یک قاشق فلزی صاف و مرتب کنید.\n" +
                        " \n" +
                        "۶- کیک پنیری را به مدت یک ساعت در یخچال قرار دهید تا کاملا سرد شود.\n" +
                        " \n" +
                        "۷- آن را از درون قالب درآورده و به قطعات مختلف برش دهید و میل کنید.",
                2, "بیسکویت دیجستیو\n" +
                "100 گرم\n" +
                "شکر\n" +
                "50 گرم\n" +
                "کره آب شده\n" +
                "50 گرم\n" +
                "پنیر خامه\u200Cای پر چرب\n" +
                "500 گرم\n" +
                "خاکه قند\n" +
                "100 گرم\n" +
                "وانیل\n" +
                "یک قاشق چایخوری", "cheesecake.jpg"));

        addItem(new DataItem(null, "کیک شکلاتی ", "Desserts",
                "دا آرد و پودر کاکائو رو الک میکنیم و در یک ظرف گود میریزیم." +
                        "بعد از الک کردن باقی مواد خشک یعنی قهوه، نمک، جوش شیرین و بیکینگ پودر و وانیل رو هم روی آرد و کاکائو میریزیم." +
                        "شکر رو هم روی مواد خشک میریزیم و با دور کند همزن یا ویسک همه مواد خشک رو با هم کاملا مخلوط میکنیم." +
                        "حالا نوبت مواد تر میرسه. تخم مرغ ها رو به مواد خشک اضافه کنیم." +
                        "روغن و شیر رو هم به ترتیب اضافه میکنیم و بعد با دور تند همزن به طور کامل همه رو مخلوط میکنیم تا مایع غلیظ و کشدار بشه." +
                        "اضافه کردن روغن مایع" +
                        "اضافه کردن شیر" +
                        "همه مواد رو مخلوط میکنیم" +
                        "مهمترین مرحله ی این کیک شکلاتی اینچاست. بعد از اینکه مراحل بالا رو رفنید و همه مواد خشک و تر رو باهم مخلوط کردید و هم زدید نوبت به اضافه کردن آب جوش میرسه. همزن رو روی دور تند روشن کنید و همونطور که مایع کیک در حال هم خوردن هست، آب جوش رو کم کم اضافه میکنیم و به همون صورت با دور تند هم میزنیم تا حباب های هوا وارد مایع کیک بشه. حدود یک دقیقه مایع کیک رو با دور تند میزنیم. در نهایت باید مایع کیکی که تهیه کردید مثل عکس زیر پر از حباب باشه." +
                        "قالب کیکتون رو با کره یا روغن کاملا چرب کنید و از مایع کیک تا نصف قالب رو پر کنید. این کیک حدودا دو برابر پف میکنه پس قالب رو نباید بیشتر از نصف پر کنید." +
                        "در فر از قبل گرم شده در دمای 170 درجه حدود 30-35 دقیقه کاملا میپزه. البته وقتی کیک رو از فر خارج کنید که خلال دندون تمیز خارج بشه." +
                        "مایع کیک رو تا نصف قالب میریزیم" +
                        "برای روش هم من کمی شکلات و کره رو روی حرارت بن ماری ذوب کردم و روی کیک ریختم. با توت فرنگی هم تزیین کردم. به همین سادگی و خوشمزگی.",
                3, "آرد 2 پیمانه\n" +
                "   شکر 2 پیمانه\n" +
                "   پودر کاکائو 1 پیمانه\n" +
                "   بکینگ پودر 2 قاشق چای خوری\n" +
                "   جوش شیرین 1 قاشق چایخوری\n" +
                "   نمک 1 قاشق چای خوری\n" +
                "   روغن مایع 1/2 پیمانه\n" +
                "   2 عدد تخم مرغ بزرگ\n" +
                "   وانیل 1 قاشق چای خوری\n" +
                "   شیر 1 پیمانه\n" +
                "   آب جوش 1 پیمانه\n" +
                "   پودر قهوه یک قاشق چایخوری", "brownie.jpg"));

        addItem(new DataItem(null, "پایه سیب", "Desserts",
                "1- سیب هارو پوست گرفته و قاچ میکنیم و با یه قاشق شکر و مقداری دارچین و ته استکان آب میذاریم رو شعله گاز تا بپزه\n" +
                        "\n" +
                        "2- زرده و سفیده تخم مرغ و جدا کرده و سفیده رو همزده تا پف کنه , زرده و وانیل و مخلوط و بعد شکر را اضافه و هم میزنیم تا کرم رنگ بشه ,کره و شیر و اضافه و دوباره هم میزنیم , آرد و بکینگ پودر و که دوبار الک کردیم و اضافه و با بقیه مواد مخلوط میکنیم و در آخر سفیده تخم مرغ و اضافه و با لیسک هم میزنیم.\n" +
                        "\n" +
                        "3- کف قالب و کاغذ روغنی پهن میکنیم مقداری از مواد و ریخته و سیب هارو که پخته و سرد شده رو میچینیم و باقیمانده مواد و روی سیب ها میریزیم ,دمای فر بین صد و هفتاد و پنج تا صد و هشتاد درجه البته بستگی به فرتون داره ،و زمان پخت هم چهل و پنج دقیقه تا یکساعته , نیم ساعت اول در فر و باز نکنید تا پف کیک نخوابه.",
                4, "سیب دو عدد\n" +
                "شکر یک لیوان سرخالی\n" +
                "تخم مرغ سه عدد\n" +
                "آرد شیرینی پزی یک و نیم پیمانه\n" +
                "شیر (من ماست زدم) شیر یک سوم پیمانه\n" +
                "بکینگ پودر یک قاشق مرباخوری سرپر\n" +
                "کره صد گرم\n" +
                "وانیل نصف قاشق چای خوری", "apple_pie.jpg"));

//        addItem(new DataItem(null, "Mixed Berry Tart", "Desserts",
//                "Raspberries, blueberries, and strawberries on top of a creamy filling served in a crispy tart.",
//                5, "hdjsh", "berry_tart.jpg"));
//
//        addItem(new DataItem(null, "Tropical Blue Smoothie", "Drinks",
//                "This blueberry mint-based smoothie is refreshing and perfect for any celebration.",
//                1, "hdjsh", "smoothie.jpg"));
//
//        addItem(new DataItem(null, "Pomegranate Iced Tea", "Drinks",
//                "Our unique blend of pomegranate juice, black Rubio, and mint tea creates this light fusion of flavors.  ",
//                2, "hdjsh", "iced_tea.jpg"));
//
//        addItem(new DataItem(null, "Café Latte", "Drinks",
//                "Our house blend of espresso and foamed milk. Can be served with flavored syrups and over ice.  Non-dairy substitutions available upon request.",
//                3, "hdjsh", "cafe_latte.jpg"));

    }

    private static void addItem(DataItem dataItem) {
        dataItemList.add(dataItem);
        dataItemMap.put(dataItem.getItemId(), dataItem);
    }

}

